;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;  File : USBIPSettingsLang.ini
;;  Version 1.1
;;  This int file contains the strings that gets displayed in USBIPSettings Dll.
;;  (c) Copyright - 2008
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Instructions to add the support for any new language:
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; If you want to add any additional language support, add a section with that System Language Identifier.
; 1. Section name should be System Language Id specified with in []. 
; A table is mentioned at the end of this file which has various System Language ID's.
; Ex: [0x0411] which adds the support of Japanese language.

; 2. Add a key with the same language id and specify the key value as the language as specified in the table.
; Ex:0x0411=Japanese
; Place all your Japanese translated strings under this section with the same key names as specified in English.
;----------------------------------------------------------------------------------------------------


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
[0x0409]
0x0409=English (United States)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;----------------------------------------------------------------------------------------------------
;Strings of Dialog & Pages
;----------------------------------------------------------------------------------------------------

;strings of property page titles

IDD_PROPPAGE_APP_TAB                       =	Admin Tool
IDD_PROPPAGE_BUS_TAB                       =	Bus Driver
IDD_PROPPAGE_BUSENUM_TAB                   =	Bus Enumerator Driver
IDD_PROPPAGE_GENERAL_TAB                   =	General

;Admin Tool page

IDC_STATIC_APPSETTINGS                     =	" Admin Tool Settings "
IDC_CHECK_APP_EDITSET                      =	Edit Settings
IDC_STATIC_TRACELVL                        =	Trace Level :
IDC_STATIC_GUIRE_REFRESH                   =	GUI Refresh Period :
IDC_STATIC_DISCONNECT                      =	Stop Device Mapping  Wait Period :
IDC_AUTOCONNECT				   =	Auto Connect Devices
IDC_AUTOLAUNCH                             =    Start When Windows Starts
IDC_START_MINIMIZED                        =    Start Minimized
IDC_AUTOSTART_DEVICEMAPPING                =    Auto Start Device Mapping
IDC_BOOTSTART                              =    Start When Windows Boots

;Bus Driver page

IDC_STATIC_BUS_SET                         =	" Bus Driver Settings "
IDC_CHECK_BUS_SET                          =	Edit Settings
IDC_STATIC_B_RES                           =	" Resource Settings "
IDC_STATIC_B_MAXCONFIG                     =	Max Config Desc Count :
IDC_STATIC_B_MAXINTF                       =	Max Interface Count :
IDC_STATIC_MAX_B_PIPECNT                   =	Max Pipe Count :
IDC_STATIC_B_IRPCONTEXT                    =	Max Irp Context Count :
IDC_STATIC_B_TRACE                         =	" Trace Settings "
IDC_STATIC_B_TRLEVEL                       =	Trace Level :
IDC_STATIC_PRAUDE                          =	Printer Auto Connect Delay :

;Bus Enumerator Driver Page

IDC_STATIC_BE_SET                          =	" Bus Enumerator Driver Settings "
IDC_CHECK_BE_EDSET                         =	Edit Settings
IDC_STATIC_BE_TRACELEVEL                   =	Trace Level :

;General
IDC_STATIC_GEN_SET                         =	" General Settings "
IDC_CHECK_GEN_EDITSET                      =	Edit Settings
IDC_CHECK_NETWORK_THROTTLE                 =	Network Throttling ( Applicable for Windows 7 Only )
IDC_STATIC_GEN_UDPPORTNO		   =    Broadcast Port Number

;Other strings

IDS_ERRMSG_INVALID_REFRESHPERIOD           =	GUI Refresh period is not Valid.
IDS_ERRMSG_INVALID_WAITPERIOD              =	Disconnect Wait Period is not Valid.
IDS_ERRMSG_INVALID_MAXDESCCOUNT            =	Max Config Desc Count is not Valid.
IDS_ERRMSG_INVALID_MAXINTERFACECOUNT       =	Max Interface Count is not Valid.
IDS_ERRMSG_INVALID_MAXPIPECOUNT            =	Max Pipe Count is not Valid.
IDS_ERRMSG_INVALID_IRPCONTEXTCOUNT         =	Max Irp Context Count is not Valid.
IDS_ERRMSG_INVALID_PRINTERAUTOCONNECTDELAY =	Printer AutoConnect Delay is not Valid.
IDS_ERRMSG_SWNOTINSTALLED                  =	NUPort Software Not Installed yet!
IDS_ERRMSG_INVALID_PORTNO		   =    BroadCast Port number is not Valid.

IDS_MSG_SETTINGSSAVED_AFTERREBOOT          =	Settings saved successfully. \nThese settings will be applied after system Reboot.
IDS_MSG_SETTINGSSAVED                      =	Settings saved successfully. Applicable from the next Refresh Period.
IDS_MSG_SELECTTRACE                        =	Please Select a Trace Level
IDS_MSG_SETTINGSSAVED_AFTERNEXTLAUNCH      =    Settings saved successfully. \nThese settings will be applied after USBIP Admin tool restart.
IDS_MSG_LIMITED			           =    Could not save the Settings.
IDS_SETUP_ERRMSG_SWINTERNAL		   =	Internal SW Error.

IDS_MSG_SERVICENOTENABLED		   =    Failed to Enable the Service
IDS_MSG_SERVICENOTDISABLED		   =    Failed to Disable the Service

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Table of Language Identifiers
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;Identifier 		Language 
;----------------------------------------------------------------------------------------------------
;0x0404 		Chinese (Taiwan) 
;0x0804 		Chinese (PRC) 
;0x0c04 		Chinese (Hong Kong SAR, PRC) 
;0x1004 		Chinese (Singapore) 
;0x0409 		English (United States) 
;0x0809 		English (United Kingdom) 
;0x0c09 		English (Australian) 
;0x1009 		English (Canadian) 
;0x1409 		English (New Zealand) 
;0x1809 		English (Ireland) 
;0x1c09 		English (South Africa) 
;0x2009 		English (Jamaica) 
;0x2409 		English (Caribbean) 
;0x2809 		English (Belize) 
;0x2c09 		English (Trinidad) 
;0x040c 		French (Standard) 
;0x080c 		French (Belgian) 
;0x0c0c 		French (Canadian) 
;0x100c 		French (Switzerland) 
;0x140c 		French (Luxembourg) 
;0x0407 		German (Standard) 
;0x0807 		German (Switzerland) 
;0x0c07 		German (Austria) 
;0x1007 		German (Luxembourg) 
;0x1407 		German (Liechtenstein) 
;0x0421 		Indonesian 
;0x0410 		Italian (Standard) 
;0x0810 		Italian (Switzerland) 
;0x0411 		Japanese 
;0x0412 		Korean 
;0x0414 		Norwegian (Bokmal) 
;0x0814 		Norwegian (Nynorsk) 
;0x0415 		Polish 
;0x0416 		Portuguese (Brazil) 
;0x0816 		Portuguese (Portugal) 
;0x0418 		Romanian 
;0x0419 		Russian 
;0x040a 		Spanish (Spain, Traditional Sort) 
;0x080a 		Spanish (Mexican) 
;0x0c0a 		Spanish (Spain, Modern Sort) 
;0x100a 		Spanish (Guatemala) 
;0x140a 		Spanish (Costa Rica) 
;0x180a 		Spanish (Panama) 
;0x1c0a 		Spanish (Dominican Republic) 
;0x200a 		Spanish (Venezuela) 
;0x240a 		Spanish (Colombia) 
;0x280a 		Spanish (Peru) 
;0x2c0a 		Spanish (Argentina) 
;0x300a 		Spanish (Ecuador) 
;0x340a 		Spanish (Chile) 
;0x380a 		Spanish (Uruguay) 
;0x3c0a 		Spanish (Paraguay) 
;0x400a 		Spanish (Bolivia) 
;0x440a 		Spanish (El Salvador) 
;0x480a 		Spanish (Honduras) 
;0x4c0a 		Spanish (Nicaragua) 
;0x500a 		Spanish (Puerto Rico) 
;0x041d 		Swedish 
;0x081d 		Swedish (Finland) 
;0x041e 		Thai 
;0x0452 		Welsh (United Kingdom)
